# 导入模块

In [3]:
# 提示，没有安装模块的话，可以直接在jupyter中使用!
# !(pip install pandas && pip install numpy)
# !表示你可以直接使用shell命令，如!cd ..

In [4]:
# 查看当前程序的工作环境
import sys

sys.executable

'/root/jupyter env/bin/python'

In [5]:
import os

In [6]:
import pandas as pd
import numpy as np

# 读取数据

In [7]:
# 获取当前工作路径
os.getcwd()

'/root/hands-on-eda'

In [8]:
# 获取当前目录下的文件名
os.listdir()

['README.md', '.ipynb_checkpoints', 'Chapter1_session1.ipynb', '.git']

In [14]:
# 获取相对路径下的文件名
os.listdir('../Datawhale_learning/hands_on_eda/hands-on-data-analysis/第一单元项目集合/')

['第一章：第二节pandas基础.ipynb',
 '.DS_Store',
 '.ipynb_checkpoints',
 '第一章：第三节探索性数据分析.ipynb',
 'train.csv',
 '第一章：第一节数据载入及初步观察.ipynb',
 'train_chinese.csv',
 'test_1.csv',
 '第一章：第二节pandas基础-课程.ipynb',
 '第一章：第一节数据载入及初步观察-课程.ipynb',
 '第一章第三节：探索性数据分析-课程.ipynb']

In [15]:
# 读取数据
os.chdir('../Datawhale_learning/hands_on_eda/hands-on-data-analysis/第一单元项目集合/')

In [16]:
# 这里给的文件是csv格式的，如果是tsv怎么读取呢？
# tsv中的t 表示tab。说明文件里面的数据都是用的空格隔开的，设置sep参数为空格即可。csv用的是comma
train = pd.read_csv('train.csv', sep=',')

In [17]:
# chunksize参数是什么呢？
# 有时候数据太大，如果一次性直接全部读取完毕，内存会吃不消
# 参考 https://blog.csdn.net/weixin_43790560/article/details/88587123
train1 = pd.read_csv('train.csv', chunksize=400)

In [18]:
# 可以发现，我们要使用for循环来处理每一块数据
# 每个i都是一个单独的DataFrame，可以使用DF的每个内置函数
for i in train1:
    print(i.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [19]:
# 接下来要将行的名称改变.使用内置的rename函数
train_name = train.columns.to_list()
train_name

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [20]:
new_train_name = ['乘客ID', '是否幸存', '乘客等级(1/2/3等舱位)', '乘客姓名', '性别', '年龄', '堂兄弟/妹个数', '父母与小孩个数', '船票信息', '票价', '客舱', '登船港口',]

In [21]:
# 使用zip函数将两个列表合并起来
name = dict(zip(train_name, new_train_name))
name

{'PassengerId': '乘客ID',
 'Survived': '是否幸存',
 'Pclass': '乘客等级(1/2/3等舱位)',
 'Name': '乘客姓名',
 'Sex': '性别',
 'Age': '年龄',
 'SibSp': '堂兄弟/妹个数',
 'Parch': '父母与小孩个数',
 'Ticket': '船票信息',
 'Fare': '票价',
 'Cabin': '客舱',
 'Embarked': '登船港口'}

In [33]:
# 使用data1进行测试
for each in train1:
    each = each.rename(columns=name)
for each in train1:
    print(each.columns)

In [60]:
test = pd.read_csv('test_1.csv')

In [61]:
# 这里我们发现有个unnamed:0
test.head(3)

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,100
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,100
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,100

In [64]:
# 发现多出了一列
# 使用index_col参数即可解决
test = pd.read_csv('test_1.csv', index_col=0)

In [63]:
test.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,100
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,100
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,100
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,100
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,100

In [26]:
# !cat test_1.csv 
# ,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,a
# 0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,,S,100
# 1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C,100
# 2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,,S,100
# 3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1,C123,S,100

# 分析数据

In [27]:
# 查看缺失值

train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [28]:
# 查看缺失值的数量，缺陷就是看不出占总数的多少
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [29]:
# 这样查看缺失率，可以看出Cabin缺失的相当多
train.isnull().mean()

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [32]:
# 查看数据类型
# object类通常都是分类数据，这个要自己查看
train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# 数据保存

In [35]:
train.rename(columns=name, inplace=True)

In [36]:
train.head(3)

,乘客ID,是否幸存,乘客等级(1/2/3等舱位),乘客姓名,性别,年龄,堂兄弟/妹个数,父母与小孩个数,船票信息,票价,客舱,登船港口
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [49]:
train.to_csv('train_chinese.csv', index=None)

In [50]:
pd.read_csv('train_chinese.csv').head(3)

,乘客ID,是否幸存,乘客等级(1/2/3等舱位),乘客姓名,性别,年龄,堂兄弟/妹个数,父母与小孩个数,船票信息,票价,客舱,登船港口
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

# 问题

## 问题1

In [77]:
# 我使用这个方法读取数据
train1 = pd.read_csv('train.csv', chunksize=400)
name = {'PassengerId': '乘客ID',
 'Survived': '是否幸存',
 'Pclass': '乘客等级(1/2/3等舱位)',
 'Name': '乘客姓名',
 'Sex': '性别',
 'Age': '年龄',
 'SibSp': '堂兄弟/妹个数',
 'Parch': '父母与小孩个数',
 'Ticket': '船票信息',
 'Fare': '票价',
 'Cabin': '客舱',
 'Embarked': '登船港口'}
# 使用data1进行测试，但是打印的数据是空的，里面的数据貌似都被垃圾回收了
for each in train1:
    each = each.rename(columns=name)
# 发现打印不出来。那么如果设置了chunksize这个参数，我该怎么修改数据呢？
for each in train1:
    print(each.columns)

## 问题2

In [86]:
# test_1在读取的时候，多出了一列unnamed:0,这是怎么回事？